docs/java/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-30 Wed 00:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Java</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Katherine Chuang" />

<link rel="stylesheet" type="text/css" href="assets/style.min.css"/>

</head>
<body>
<div id="content">
<h1 class="title">Java</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc7a0e37">1. Intro</a>
<ul>
<li><a href="#orge57c08e">Helpful links</a>
<ul>
<li><a href="#orgcc2e2e6">The Java Tutorials for JDK 8</a></li>
<li><a href="#org845f79d">Java SE 8 Documenatation</a></li>
<li><a href="#org3b33b51">Java SE 8 API</a></li>
<li><a href="#org3bbeee0">Java Code Visualizer</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org50b17d2">Concepts</a>
<ul>
<li><a href="#org6b4f93d">Variables</a></li>
<li><a href="#orgd8c84ae">Primitive Data Types</a></li>
<li><a href="#org4c3f44c">Operators</a></li>
<li><a href="#orgb874a2c">Expressions, Statements, and Blocks</a></li>
<li><a href="#orgb0d7d2d">Control Flow Statements</a></li>
<li><a href="#orged0e8b0">Objects &amp; Classes</a></li>
<li><a href="#org4663e66">Arrays</a></li>
</ul>
</li>
<li><a href="#orgf0ae207">2. Compiling Java on Command Line</a>
<ul>
<li><a href="#org06f3901">2.1. BC Students can use the WEB Lab Server to compile and run Java code</a>
<ul>
<li><a href="#orgd5ea194">2.1.1. You can get your linux server account information from the W.E.B. Computing lab</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1590442">Java Books and other resources</a>
<ul>
<li><a href="#org6d4feda">Teach Yourself Java in 21 Minutes</a></li>
</ul>
</li>
<li><a href="#org5432186">3. Lecture Slides</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc7a0e37" class="outline-2">
<h2 id="orgc7a0e37"><span class="section-number-2">1</span> Intro</h2>
<div class="outline-text-2" id="text-1">
<p>
The CIS department at Brooklyn College <i>officially supports</i> Java 8. This means that <i>Java courses</i> are taught adhering to this version. Using later versions such as <i>Java 11</i> is perfectly find for most instances, there may be some minor differences with certain classes and methods or certain version specific-quirks.
</p>

<p>
The best thing to do is to keep documentation links handy.
</p>
</div>
<div id="outline-container-orge57c08e" class="outline-3">
<h3 id="orge57c08e">Helpful links</h3>
<div class="outline-text-3" id="text-orge57c08e">
<p>
These are useful links to reference.
</p>
</div>

<div id="outline-container-orgcc2e2e6" class="outline-4">
<h4 id="orgcc2e2e6">The Java Tutorials for JDK 8</h4>
<div class="outline-text-4" id="text-orgcc2e2e6">
<p>
<a href="https://docs.oracle.com/javase/tutorial/index.html">https://docs.oracle.com/javase/tutorial/index.html</a>
</p>
</div>
</div>
<div id="outline-container-org845f79d" class="outline-4">
<h4 id="org845f79d">Java SE 8 Documenatation</h4>
<div class="outline-text-4" id="text-org845f79d">
<p>
<a href="https://docs.oracle.com/javase/8/">https://docs.oracle.com/javase/8/</a>
</p>
</div>
</div>
<div id="outline-container-org3b33b51" class="outline-4">
<h4 id="org3b33b51">Java SE 8 API</h4>
<div class="outline-text-4" id="text-org3b33b51">
<p>
<a href="https://docs.oracle.com/javase/8/docs/api/index.html">https://docs.oracle.com/javase/8/docs/api/index.html</a>
</p>
</div>
</div>
<div id="outline-container-org3bbeee0" class="outline-4">
<h4 id="org3bbeee0">Java Code Visualizer</h4>
<div class="outline-text-4" id="text-org3bbeee0">
<p>
<a href="http://www.pythontutor.com/java.html#mode=edit">http://www.pythontutor.com/java.html#mode=edit</a>
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org50b17d2" class="outline-2">
<h2 id="org50b17d2">Concepts</h2>
<div class="outline-text-2" id="text-org50b17d2">
</div>
<div id="outline-container-org6b4f93d" class="outline-3">
<h3 id="org6b4f93d">Variables</h3>
</div>
<div id="outline-container-orgd8c84ae" class="outline-3">
<h3 id="orgd8c84ae">Primitive Data Types</h3>
</div>
<div id="outline-container-org4c3f44c" class="outline-3">
<h3 id="org4c3f44c">Operators</h3>
</div>
<div id="outline-container-orgb874a2c" class="outline-3">
<h3 id="orgb874a2c">Expressions, Statements, and Blocks</h3>
</div>
<div id="outline-container-orgb0d7d2d" class="outline-3">
<h3 id="orgb0d7d2d">Control Flow Statements</h3>
</div>
<div id="outline-container-orged0e8b0" class="outline-3">
<h3 id="orged0e8b0">Objects &amp; Classes</h3>
</div>
<div id="outline-container-org4663e66" class="outline-3">
<h3 id="org4663e66">Arrays</h3>
</div>
</div>
<div id="outline-container-orgf0ae207" class="outline-2">
<h2 id="orgf0ae207"><span class="section-number-2">2</span> Compiling Java on Command Line</h2>
<div class="outline-text-2" id="text-2">
<p>
To compile Java source code on the command line, it is with this command where <code>Main.java</code> is your filename.
</p>

<div class="org-src-container">
<pre class="src src-shell">javac Main.java
</pre>
</div>

<p>
followed by running the executable generated with
</p>

<div class="org-src-container">
<pre class="src src-shell">java Main
</pre>
</div>
</div>

<div id="outline-container-org06f3901" class="outline-3">
<h3 id="org06f3901"><span class="section-number-3">2.1</span> BC Students can use the WEB Lab Server to compile and run Java code</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Use a terminal friendly app to connect to the server via ssh. A sample command is as follows:
</p>

<div class="org-src-container">
<pre class="src src-shell">ssh username@hostname
</pre>
</div>

<p>
After entering your password, create a directory for your assignment, such as <code>mkdir folder1</code> and then you can use a command line such as vim, emacs, or nano to edit the file.
</p>
</div>

<div id="outline-container-orgd5ea194" class="outline-4">
<h4 id="orgd5ea194"><span class="section-number-4">2.1.1</span> You can get your linux server account information from the W.E.B. Computing lab</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
You can email the Linux Administrator, Raymond Patitucci or visit their locatio nat
</p>

<p>
First floor, West End Building
P: 718.951.5787
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org1590442" class="outline-2">
<h2 id="org1590442">Java Books and other resources</h2>
<div class="outline-text-2" id="text-org1590442">
</div>
<div id="outline-container-org6d4feda" class="outline-3">
<h3 id="org6d4feda">Teach Yourself Java in 21 Minutes</h3>
<div class="outline-text-3" id="text-org6d4feda">
<p>
<a href="https://fileadmin.cs.lth.se/cs/Education/EDA040/common/java21.pdf">https://fileadmin.cs.lth.se/cs/Education/EDA040/common/java21.pdf</a>
**
</p>
</div>
</div>
</div>
<div id="outline-container-org5432186" class="outline-2">
<h2 id="org5432186"><span class="section-number-2">3</span> Lecture Slides</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><p>
Java Review
</p>
<iframe src="https://docs.google.com/presentation/d/e/2PACX-1vRtXxeatgBGq7xebtDWbsPFZfe6hmx_EllwyN7SH58xpeZhLp0pP3nhGza2tG2KeBXTwNJOrniM-99Q/embed?start=false&loop=false&delayms=3000" frameborder="0" height="300" width="400" allowfullscreen="true" mozallowfullscreen="true" webkitallowfullscreen="true"></iframe></li>
<li><p>
Two Dimensional Arrays
</p>
<p><iframe allowfullscreen="true" frameborder="0" height="300" mozallowfullscreen="true" src="https://docs.google.com/presentation/d/e/2PACX-1vQ1ToT9Ovyob0CbcORIXdaraIewpmfPhgwBxKTPbcB4y4wo_NEODQ3Jsw-wprFh9_V-wM1NjzuN_pkO/embed?start=false&amp;loop=false&amp;delayms=3000" webkitallowfullscreen="true" width="400"></iframe></p></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Katherine Chuang</p>
<p class="date">Created: 2020-09-30 Wed 00:47</p>
</div>
</body>
</html>
